app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("title", "desc", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Test1"], ["desc", "This is ana example"], ["created_at", "2016-06-21 01:45:20.467607"], ["updated_at", "2016-06-21 01:45:20.467607"]]

  def update
    respond_to do |format|
      if @category.update(category_params)
---
UPDATE "categories" SET "title" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["title", "Test Projects"], ["updated_at", "2016-06-21 01:44:56.272561"], ["id", 21]]