app/controllers/documents_controller.rb

  def index
    @documents = Document.all
---
SELECT "documents".* FROM "documents"

  def show
    @document = Document.friendly.find(params[:id])
---
SELECT  "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT 1  [["id", 12]]

    def set_document
      @document = Document.friendly.find(params[:id])
---
SELECT  "documents".* FROM "documents" WHERE "documents"."id" = $1 LIMIT 1  [["id", 39]]